AxDen-Dev/NRF52_Smart_Agriculture_example/main.c
static volatile uint8_t tx_complete_state = 0x01;
static volatile uint8_t aggregator_notify_enable_state = 0x00;
static volatile uint8_t stream_notify_enable_state = 0x00;
static volatile uint16_t disconnect_timeout_count = 0;
static volatile uint8_t request_disconnect = 0x00;
static volatile uint8_t data_update_state = 0x00;

static uint8_t mac_address[8] = { 0x00 };

static packet_header_0_t packet_header_0;
static packet_header_1_t packet_header_1;
static packet_event_0_t packet_event_0;
static packet_event_1_t packet_event_1;
static product_id_t product_id;

static volatile uint8_t packet_id = 0;
static volatile uint8_t command_id = 0;
static volatile uint8_t node_packet_data_size;
static node_packet_data_t node_packet_data;

static uint32_t collection_cycle_timeout_count = 0;
static uint32_t collection_cycle_timer_count = COLLECTION_CYCLE_TIMEOUT;
static volatile uint8_t collection_cycle_update = 0x00;

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data = { .adv_data = { .p_data = m_enc_advdata,
		.len = BLE_GAP_ADV_SET_DATA_SIZE_MAX }, .scan_rsp_data = { .p_data =
		m_enc_scan_response_data, .len = BLE_GAP_ADV_SET_DATA_SIZE_MAX

} };

/**@brief Function for assert macro callback.
 *
 * @details This function will be called in case of an assert in the SoftDevice.
 *
 * @warning This handler is an example only and does not fit a final product. You need to analyze
 *          how your product is supposed to react in case of Assert.
 * @warning On assert from the SoftDevice, the system can only recover on reset.
 *
 * @param[in] line_num    Line number of the failing ASSERT call.
 * @param[in] p_file_name File name of the failing ASSERT call.
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name) {
	app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**@brief Function for the Timer initialization.
 *
 * @details Initializes the timer module.
 */

static void app_time_timeout_handler(void *p_context) {
	static uint8_t one_sec_timer_count = 0;
	UNUSED_PARAMETER(p_context);

	one_sec_timer_count += 1;

	if (one_sec_timer_count > 10) {

		collection_cycle_timeout_count += 1;

		if (collection_cycle_timeout_count >= collection_cycle_timer_count) {

			collection_cycle_update = 0x01;
			collection_cycle_timeout_count = 0;

		}

		one_sec_timer_update = 0x01;

		one_sec_timer_count = 0;

		NRF_LOG_INFO("collection_cycle_timeout_count %d / %d",
				collection_cycle_timeout_count, collection_cycle_timer_count);

	}

	bme280_100ms_timer = 0x01;
	hdc1080_100ms_timer = 0x01;
	vcnl4040_100ms_timer = 0x01;

	app_timer_update = 0x01;

}

static void timers_init(void) {

	// Initialize timer module, making it use the scheduler
	ret_code_t err_code = app_timer_init();
	APP_ERROR_CHECK(err_code);

	err_code = app_timer_create(&m_app_timer_id, APP_TIMER_MODE_REPEATED,
			app_time_timeout_handler);
	APP_ERROR_CHECK(err_code);

}

/**@brief Function for the GAP initialization.
 *
 * @details This function sets up all the necessary GAP (Generic Access Profile) parameters of the
 *          device including the device name, appearance, and the preferred connection parameters.
 */
static void gap_params_init(void) {
	ret_code_t err_code;
	ble_gap_conn_params_t gap_conn_params;
	ble_gap_conn_sec_mode_t sec_mode;

	BLE_GAP_CONN_SEC_MODE_SET_OPEN(&sec_mode);

	err_code = sd_ble_gap_device_name_set(&sec_mode,
			(const uint8_t*) DEVICE_NAME, strlen(DEVICE_NAME));
	APP_ERROR_CHECK(err_code);

	memset(&gap_conn_params, 0, sizeof(gap_conn_params));

	gap_conn_params.min_conn_interval = MIN_CONN_INTERVAL;
	gap_conn_params.max_conn_interval = MAX_CONN_INTERVAL;
	gap_conn_params.slave_latency = SLAVE_LATENCY;
	gap_conn_params.conn_sup_timeout = CONN_SUP_TIMEOUT;

	err_code = sd_ble_gap_ppcp_set(&gap_conn_params);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the GATT module.
 */
static void gatt_init(void) {
	ret_code_t err_code = nrf_ble_gatt_init(&m_gatt, NULL);
	APP_ERROR_CHECK(err_code);
}

/**@brief Function for initializing the Advertising functionality.
 *
 * @details Encodes the required advertising data and passes it to the stack.
 *          Also builds a structure to be passed to the stack when starting advertising.
 */
static void advertising_init(uint8_t data_update_state) {

	ret_code_t err_code;
	ble_advdata_t advdata;
	ble_advdata_t srdata;
	uint32_t interval = APP_IDLE_ADV_INTERVAL;

	// Build and set advertising data.
	memset(&advdata, 0, sizeof(advdata));

	advdata.name_type = BLE_ADVDATA_FULL_NAME;
	advdata.include_appearance = true;
	advdata.flags = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

	if (data_update_state) {

		ble_uuid_t adv_uuids[] = { { BLE_DATA_READY_UUID_SCAN_SERVICE,
				m_service.uuid_type } };

		memset(&srdata, 0, sizeof(srdata));
		srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids)
				/ sizeof(adv_uuids[0]);
		srdata.uuids_complete.p_uuids = adv_uuids;

		interval = APP_DATA_READY_ADV_INTERVAL;

	} else {

		ble_uuid_t adv_uuids[] = { { BLE_IDLE_UUID_SCAN_SERVICE,
				m_service.uuid_type } };

		memset(&srdata, 0, sizeof(srdata));
		srdata.uuids_complete.uuid_cnt = sizeof(adv_uuids)
				/ sizeof(adv_uuids[0]);
		srdata.uuids_complete.p_uuids = adv_uuids;

		interval = APP_IDLE_ADV_INTERVAL;

	}

	err_code = ble_advdata_encode(&advdata, m_adv_data.adv_data.p_data,
			&m_adv_data.adv_data.len);
	APP_ERROR_CHECK(err_code);

	err_code = ble_advdata_encode(&srdata, m_adv_data.scan_rsp_data.p_data,
			&m_adv_data.scan_rsp_data.len);
	APP_ERROR_CHECK(err_code);

	ble_gap_adv_params_t adv_params;

	// Set advertising parameters.
	memset(&adv_params, 0, sizeof(adv_params));

	adv_params.primary_phy = BLE_GAP_PHY_1MBPS;
	adv_params.duration = APP_ADV_DURATION;
	adv_params.properties.type =
	BLE_GAP_ADV_TYPE_CONNECTABLE_SCANNABLE_UNDIRECTED;
	adv_params.p_peer_addr = NULL;
	adv_params.filter_policy = BLE_GAP_ADV_FP_ANY;
	adv_params.interval = interval;

	err_code = sd_ble_gap_adv_set_configure(&m_adv_handle, &m_adv_data,
			&adv_params);
	APP_ERROR_CHECK(err_code);

