AxDen-Dev/NRF52_Smart_Agriculture_example/main.c
	}

	err_code = nrf_drv_ppi_init();

	if (err_code != NRF_ERROR_INVALID_STATE) {

		APP_ERROR_CHECK(err_code);

	}

	err_code = nrf_drv_ppi_channel_alloc(&ppi_set_ch);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_ppi_channel_alloc(&ppi_clr_ch);
	APP_ERROR_CHECK(err_code);

	err_code = nrf_drv_gpiote_out_init(FEM_CRX, &config);
	APP_ERROR_CHECK(err_code);

	gpiote_ch = nrf_drv_gpiote_out_task_addr_get(FEM_CRX);

	memset(&opt, 0, sizeof(ble_opt_t));
	opt.common_opt.pa_lna.gpiote_ch_id = (gpiote_ch - NRF_GPIOTE_BASE) >> 2; // GPIOTE channel used for radio pin toggling
	opt.common_opt.pa_lna.ppi_ch_id_clr = ppi_clr_ch; // PPI channel used for radio pin clearing
	opt.common_opt.pa_lna.ppi_ch_id_set = ppi_set_ch; // PPI channel used for radio pin setting

	opt.common_opt.pa_lna.pa_cfg.active_high = 1; // Set the pin to be active high
	opt.common_opt.pa_lna.pa_cfg.enable = 1;              // Enable toggling
	opt.common_opt.pa_lna.pa_cfg.gpio_pin = FEM_CTX; // The GPIO pin to toggle

	opt.common_opt.pa_lna.lna_cfg.active_high = 1; // Set the pin to be active high
	opt.common_opt.pa_lna.lna_cfg.enable = 1;             // Enable toggling
	opt.common_opt.pa_lna.lna_cfg.gpio_pin = FEM_CRX; // The GPIO pin to toggle

	err_code = sd_ble_opt_set(BLE_COMMON_OPT_PA_LNA, &opt);
	APP_ERROR_CHECK(err_code);

}

#endif

static void gpio_init() {

	nrf_gpio_cfg_output(GPIO_LED_0);
	nrf_gpio_pin_clear(GPIO_LED_0);

	nrf_gpio_cfg_output(GPIO_LED_1);
	nrf_gpio_pin_clear(GPIO_LED_1);

	nrf_gpio_cfg_output(GPIO_BAT_EN);
	nrf_gpio_pin_clear(GPIO_BAT_EN);

	nrf_gpio_cfg_output(GPIO_SENSOR_POWER_EN);
	nrf_gpio_pin_clear(GPIO_SENSOR_POWER_EN);

	nrf_gpio_cfg_input(GPIO_BTN, NRF_GPIO_PIN_PULLUP);

}

static void build_event_packet(uint8_t event_type) {

//	uint8_t header_0;
//	uint8_t header_1;
//	uint8_t mac_address[8];
//	uint8_t product_id[2];
//	uint8_t event_value_0;
//	uint8_t event_value_1;

	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_EVENT_HEADER_0;

	node_packet_data.Event_Packet.header_0 = packet_header_0.value;
	node_packet_data.Event_Packet.header_1 = packet_header_1.value;

	memcpy(node_packet_data.Event_Packet.mac_address, mac_address,
			sizeof(mac_address));

	node_packet_data.Event_Packet.product_id[0] = product_id.value >> 8;
	node_packet_data.Event_Packet.product_id[1] = product_id.value;

	packet_event_0.bits.EVENT_TYPE = event_type;
	node_packet_data.Event_Packet.event_value_0 = packet_event_0.value;
	node_packet_data.Event_Packet.event_value_1 = packet_event_1.value;

	node_packet_data_size = NODE_EVENT_PACKET_SIZE;

	NRF_LOG_INFO("build_event_packet");

}

static void build_sensor_data_packet() {

//	uint8_t header_0;
//	uint8_t header_1;
//	uint8_t mac_address[8];
//	uint8_t packet_info;
//	uint8_t battery_value;
//	uint8_t temperature[2];
//	uint8_t pressure[4];
//	uint8_t humidity;
//	uint8_t ambient_light[2];

	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_SENSOR_DATA_HEADER_0;

	node_packet_data.Data_Packet.header_0 = packet_header_0.value;
	node_packet_data.Data_Packet.header_1 = packet_header_1.value;

	memcpy(node_packet_data.Data_Packet.mac_address, mac_address,
			sizeof(mac_address));

	node_packet_data.Data_Packet.packet_info = (command_id << 4) & 0xF0;
	node_packet_data.Data_Packet.packet_info |= (packet_id & 0x0F);

	node_packet_data.Data_Packet.battery_value = battery_value;

	node_packet_data.Data_Packet.temperature[0] = temperature >> 8;
	node_packet_data.Data_Packet.temperature[1] = temperature;

	node_packet_data.Data_Packet.pressure[0] = pressure >> 24;
	node_packet_data.Data_Packet.pressure[1] = pressure >> 16;
	node_packet_data.Data_Packet.pressure[2] = pressure >> 8;
	node_packet_data.Data_Packet.pressure[3] = pressure;

	node_packet_data.Data_Packet.humidity = humidity;

	node_packet_data.Data_Packet.ambient_light[0] = ambient_light >> 8;
	node_packet_data.Data_Packet.ambient_light[1] = ambient_light;

	node_packet_data_size = NODE_DATA_PACKET_SIZE;

	packet_id += 1;

	if (packet_id > 0x0F) {

		packet_id = 0;

	}

	NRF_LOG_INFO("build_sensor_data_packet");

}

/**@brief Function for application main entry.
 */
int main(void) {

	uint8_t event_init = 0x00;
	uint8_t event_type = EVENT_TYPE_POWER_ON;

	uint8_t event_packet_ready = 0x00;
	uint8_t sensor_data_packet_ready = 0x00;

	uint8_t battery_read_step = 0x00;

	uint8_t on_off_state = 0x01;
	uint8_t on_off_count = 0;

	uint32_t device_id_0 = NRF_FICR->DEVICEID[1];
	uint32_t device_id_1 = NRF_FICR->DEVICEID[0];

	mac_address[0] = device_id_0 >> 24;
	mac_address[1] = device_id_0 >> 16;
	mac_address[2] = device_id_0 >> 8;
	mac_address[3] = device_id_0;

	mac_address[4] = device_id_1 >> 24;
	mac_address[5] = device_id_1 >> 16;
	mac_address[6] = device_id_1 >> 8;
	mac_address[7] = device_id_1;

	log_init();

	timers_init();

	gpio_init();

	twi_init();

	init_uart_2();

	power_management_init();

	ble_stack_init();

#ifdef NRF528XX_FEM

	fem_init();

#endif

	gap_params_init();

	gatt_init();

	services_init();

	advertising_init(data_update_state);

	conn_params_init();

	app_timer_start(m_app_timer_id, APP_TIMER_DELAY, NULL);

	/////////////////////// Init Protocol Data /////////////////////

	packet_header_0.value = 0x00;
	packet_header_0.bits.DEVICE_ROLE = 0x00;
	packet_header_0.bits.PACKET_TYPE = PACKET_TYPE_UPLINK_EVENT_HEADER_0;
	packet_header_0.bits.CHIP_MANUFACTURER = CHIP_MANUFACTURER_NORDIC;

	packet_header_1.value = 0x00;
	packet_header_1.bits.CHIP_IDENTIFIER = CHIP_IDENTIFIER_NRF52832;
	packet_header_1.bits.COMMUNICATION_TYPE =
	COMMUNICATION_TYPE_BLE_CONNECTION_1M;

	product_id.value = 0x00;
	product_id.bits.PRODUCT_ID = PRODUCT_ID_AA_MB_03;
	product_id.bits.DEVICE_TYPE = 0x00;
	product_id.bits.PRODUCT_TYPE = 0x01;

	packet_event_0.value = 0x00;
	packet_event_0.bits.EVENT_TYPE = EVENT_TYPE_POWER_ON;

	packet_event_1.value = 0x00;

	//////////////////// Start Application ///////////////////

	set_uart_usb_in_out_write_string("Start AxDen SmartAgriculture example");

