AxDen-Dev/NRF52_Smart_Agriculture_example/main.c
	set_uart_usb_in_out_mac_address(mac_address);

	nrf_gpio_pin_set(GPIO_SENSOR_POWER_EN);

	wait_200ms();

	twi_scan();

	set_bme280_twi_instance(m_twi);

	if (!init_bme280()) {

		packet_event_1.bits.BME280_ERROR = 0x01;

	}

	wait_200ms();

	if (!get_bme280_temperature(&temperature)) {

		packet_event_1.bits.BME280_ERROR = 0x01;

	}

	if (!get_bme280_pressure(&pressure)) {

		packet_event_1.bits.BME280_ERROR = 0x01;

	}

	set_hdc1080_twi_instance(m_twi);

	if (!init_hdc1080()) {

		packet_event_1.bits.HDC1080_ERROR = 0x01;

	}

	wait_200ms();

	if (!get_hdc1080_temperature_humidity(&temperature, &humidity)) {

		packet_event_1.bits.HDC1080_ERROR = 0x01;

	}

	set_vcnl4040_twi_instance(m_twi);

	if (!init_vcnl4040()) {

		packet_event_1.bits.VCNL4040_ERROR = 0x01;

	}

	wait_200ms();

	if (!get_vcnl4040_ambient_light(&ambient_light)) {

		packet_event_1.bits.VCNL4040_ERROR = 0x01;

	}

	nrf_gpio_pin_set(GPIO_BAT_EN);

	wait_200ms();

	read_battery_level();

	//////////////////// Print Value ///////////////////

	set_uart_usb_in_out_battery(battery_value);

	set_uart_usb_in_out_temperature(temperature);

	set_uart_usb_in_out_pressure(pressure);

	set_uart_usb_in_out_humidity(humidity);

	set_uart_usb_in_out_lux(ambient_light);

	//////////////////// Start Main Loop ///////////////////

	event_packet_ready = 0x01;
	data_update_state = 0x01;
	advertising_init(data_update_state);

	advertising_start();

	NRF_LOG_INFO("Start main loop");

	for (;;) {

		if (one_sec_timer_update) {

			if (!nrf_gpio_pin_read(GPIO_BTN)) {

				on_off_count += 1;

				if (on_off_count >= 3) {

					if (on_off_state) {

						event_type = EVENT_TYPE_POWER_OFF;

						NRF_LOG_INFO("EVENT_TYPE_POWER_OFF");

					} else {

						event_type = EVENT_TYPE_POWER_ON;

						NRF_LOG_INFO("EVENT_TYPE_POWER_ON");

					}

					event_init = 0x00;
					event_packet_ready = 0x01;
					data_update_state = 0x01;

					if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

						adversting_stop();
						gap_params_init();
						advertising_init(data_update_state);
						advertising_start();

					} else {

						sd_ble_gap_disconnect(m_conn_handle,
						BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

					}

					on_off_state = !on_off_state;
					on_off_count = 0;

					NRF_LOG_INFO("on_off_state %d", on_off_state);

				}

				nrf_gpio_pin_clear(GPIO_LED_0);

			} else {

				on_off_count = 0;

				nrf_gpio_pin_set(GPIO_LED_0);

			}

			one_sec_timer_update = 0x00;

		}

		if (on_off_state && event_init) {

			if (collection_cycle_update) {

				if (battery_read_step == 0x00) {

					nrf_gpio_pin_set(GPIO_BAT_EN);

					battery_read_step = 0x01;

				} else {

					read_battery_level();

					packet_event_1.bits.BME280_ERROR = 0x00;

					if (!get_bme280_temperature(&temperature)) {

						packet_event_1.bits.BME280_ERROR = 0x01;

						event_type = EVENT_TYPE_RUN_TIME_EVENT;
						event_packet_ready = 0x01;

						NRF_LOG_INFO("BME280_ERROR");

					} else {

						NRF_LOG_INFO("temperature %d", temperature);

					}

					if (!get_bme280_pressure(&pressure)) {

						packet_event_1.bits.BME280_ERROR = 0x01;

						event_type = EVENT_TYPE_RUN_TIME_EVENT;
						event_packet_ready = 0x01;

						NRF_LOG_INFO("BME280_ERROR");

					} else {

						NRF_LOG_INFO("pressure %d", pressure);

					}

					packet_event_1.bits.HDC1080_ERROR = 0x00;

					if (!get_hdc1080_temperature_humidity(&temperature,
							&humidity)) {

						packet_event_1.bits.HDC1080_ERROR = 0x01;

						event_type = EVENT_TYPE_RUN_TIME_EVENT;
						event_packet_ready = 0x01;

						NRF_LOG_INFO("HDC1080_ERROR");

					} else {

						NRF_LOG_INFO("humidity %d", humidity);

					}

					packet_event_1.bits.VCNL4040_ERROR = 0x00;

					if (!get_vcnl4040_ambient_light(&ambient_light)) {

						packet_event_1.bits.VCNL4040_ERROR = 0x01;

						event_type = EVENT_TYPE_RUN_TIME_EVENT;
						event_packet_ready = 0x01;

						NRF_LOG_INFO("VCNL4040_ERROR");

					} else {

						NRF_LOG_INFO("ambient_light %d", ambient_light);

					}

					set_uart_usb_in_out_battery(battery_value);

					set_uart_usb_in_out_temperature(temperature);

					set_uart_usb_in_out_pressure(pressure);

					set_uart_usb_in_out_humidity(humidity);

					set_uart_usb_in_out_lux(ambient_light);

					sensor_data_packet_ready = 0x01;

					battery_read_step = 0x00;

					collection_cycle_update = 0x00;

					data_update_state = 0x01;

					if (m_conn_handle == BLE_CONN_HANDLE_INVALID) {

						adversting_stop();

						gap_params_init();

						advertising_init(data_update_state);

						advertising_start();

					}

					NRF_LOG_INFO("Sensor Data Update");

				}

			}

		}

		if (m_conn_handle != BLE_CONN_HANDLE_INVALID) {

			if (aggregator_notify_enable_state || stream_notify_enable_state) {

				if (event_packet_ready || sensor_data_packet_ready) {

					if (tx_complete_state == 0x01) {

						tx_complete_state = 0x00;

						if (event_packet_ready == 0x01) {

							build_event_packet(event_type);

						} else if (sensor_data_packet_ready == 0x01) {

							build_sensor_data_packet();

						}

						if (aggregator_notify_enable_state) {

							ble_service_send_aggregator_notification(
									m_conn_handle, &m_service,
									node_packet_data.buffer,
									node_packet_data_size);

							NRF_LOG_INFO("Gateway notify send");

						} else if (stream_notify_enable_state) {

							ble_service_send_stream_notification(m_conn_handle,
									&m_service, node_packet_data.buffer,
									node_packet_data_size);

							NRF_LOG_INFO("Stream notify send");

						}

					} else if (tx_complete_state == 0x02) {

						if (event_packet_ready == 0x01) {

							event_packet_ready = 0x00;

						} else if (sensor_data_packet_ready == 0x01) {

							sensor_data_packet_ready = 0x00;

						}

						if (!event_packet_ready && !sensor_data_packet_ready) {

							data_update_state = 0x00;
							disconnect_timeout_count = DISCONNECT_TIMEOUT;

						} else {

							tx_complete_state = 0x01;

						}

						event_init = 0x01;

					}

				}

				if (stream_notify_enable_state) {

					disconnect_timeout_count = 0;

				}

			}

			disconnect_timeout_count++;

			if (disconnect_timeout_count > DISCONNECT_TIMEOUT) {

				if (request_disconnect == 0x00) {

					sd_ble_gap_disconnect(m_conn_handle,
					BLE_HCI_REMOTE_USER_TERMINATED_CONNECTION);

					request_disconnect = 0x01;

					NRF_LOG_INFO("Disconnect request");

				}

			}

		} else {

			disconnect_timeout_count = 0;

		}

		while (!app_timer_update) {

			idle_state_handle();

		}

		app_timer_update = 0x00;

		nrf_gpio_pin_toggle(GPIO_LED_1);

		NRF_LOG_FLUSH();

	}
}

/**
 * @}
 */
